---
kind: enumMember
id: F:Autodesk.Revit.DB.BaseLoadOn.kUseDefaultLoad
enum: Autodesk.Revit.DB.BaseLoadOn
source: html/89ff9f32-0abe-ed50-b25b-3d0cc7c89689.htm
---
# Autodesk.Revit.DB.BaseLoadOn.kUseDefaultLoad

Return BaseLoadOn is UseDefaultLoad. Obsoleted from 2018, use kBySpaceType instead.